#  Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Подумайте, как это можно решить с помощью рекурсии.
# Пример:
# 45 -> 101101
# 3 -> 11
# 2 -> 10

def dec_bin(num):
    if num >= 2:
        dec_bin(num // 2)
    print(num % 2, end='')
    return num
number = int(input("Введите число для преобразовывания десятичного числа в двоичное:\n"))
dec_bin(number)
