# 1- Задайте список из нескольких чисел. Напишите программу,
#  которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

def find_sum(nums):
  sum=0
  for i in nums:
       sum=sum+i
  print(f"сумма элементов равна= {sum}") 
  return sum

nums = [2, 3, 5, 9, 3, 6, 1, 100]
print(f"заданный массив {nums}")
nums = nums[1:11:2]
print(f"массив из нечетных элементов исходного массива {nums}")
find_sum(nums)

